declare
 
   type arrtype is array(3000) of varchar2(200);
   --type arrtype is table of varchar2(100) index by BINARY_INTEGER; 

    
   namearr arrtype:= arrtype('ÃÎç÷','ÒäÁø','Ö®ÌÒ','Ä½Çà','ÎÊÀ¼','¶ûá°','ÔªÏã','³õÏÄ','ÅæİÕ','°ÁÉº','ÂüÎÄ','ÀÖÁâ','³ÕÉº','ºŞÓñ','Ï§ÎÄ','Ïãº®','ĞÂÈá','ÓïÈØ','º£°²','Ò¹ÈØ','º­°Ø','Ë®ÌÒ','×íÀ¶','´º¶ù','ÓïÇÙ','´ÓÍ®','°ÁÇç','ÓïÀ¼','ÓÖÁâ','±ÌÍ®','ÔªËª','Á¯ÃÎ','×Ïº®','ÃîÍ®','ÂüÒ×','ÄÏÁ«','×Ï´ä','Óêº®','Ò×ÑÌ','Èçİæ','ÈôÄÏ','Ñ°Õæ','ÏşÒà','ÏòÉº','Ä½Áé','ÒÔÈï','Ñ°Ñã','Ó³Ò×','Ñ©Áø','¹Âá°','Ğ¦Ëª','º£ÔÆ','ÄıÌì','ÅæÉº','º®ÔÆ','±ùĞı','Íğ¶ù','ÂÌÕæ','ÅÎ¶ù','ÏşËª','±Ì·²','ÏÄİÕ','ÂüÏã','ÈôÑÌ','°ëÃÎ','¹ÈÉ½','Ö®Ñş','±ùÂ¶','¶ûÕä','¹ÈÑ©','ÀÖİæ','º­İÕ','º£Á«','°ÁÀÙ','Çà»±','¶¬¶ù','Ò×ÃÎ','Ï§Ñ©','Íğº£','Ö®Èá','ÏÄÇà','ÒàÑş','ÃîİÕ','´ºÖñ','³ÕÃÎ','×ÏÀ¶','ÏşÇÉ','»Ã°Ø','Ôª·ç','±ù·ã','·ÃÈï','ÄÏ´º','ÜÆÈï','·²ÀÙ','·²Èá','°²ÀÙ','ÌìºÉ','º¬Óñ','ÊéÀ¼','ÑÅÇÙ','ÊéÑş','´ºÑã','´Ó°²','ÏÄ»±','ÄîÇÛ','»³Æ¼','´úÂü','»ÃÉº','¹ÈË¿','Çï´ä','°×Çç','º£Â¶','´úºÉ','º¬Óñ','ÊéÀÙ','Ìı°×','·ÃÇÙ','ÁéÑã','Çï´º','Ñ©Çà','ÀÖÑş','º¬ÑÌ','º­Ë«','Æ½µû','ÑÅÈï','°ÁÖ®','ÁéŞ±','ÂÌ´º','º¬ÀÙ','´ÓÃÎ','´ÓÈØ','³õµ¤','ÌıÀ¼','ÌıÈØ','ÓïÜ½','ÏÄÍ®','ÁèÑş','Òä´ä','»ÃÁé','Á¯İÕ','×ÏÄÏ','ÒÀÉº','ÃîÖñ','·ÃÑÌ','Á¯ÀÙ','Ó³º®','ÓÑÂÌ','±ùÆ¼','Ï§Ëª','ÁèÏã','ÜÆÀÙ','Ñã»Ü','Ó­ÃÎ','Ôª°Ø','´úİæ','×ÏÕæ','Ç§Çà','´ºÂÌ','×íµû','ÒàÂÌ','Ê«Éº','ÌıÇÛ','ĞÂÖ®','Ò×ÇÉ','ÄîÔÆ','ÏşÁé','¾²·ã','ÏÄÈØ','ÈçÄÏ','Ó×Ë¿','Çï°×','±ù°²','Çï°×','ÄÏ·ç','×íÉ½','³õÍ®','Äıº£','×ÏÎÄ','ÁèÇç','Ïã»Ü','ÑÅÇÙ','°Á°²','°ÁÖ®','³õµû','Ñ°ÌÒ','´úÇÛ','Ê«Ëª','´º°Ø','ÂÌÏÄ','±ÌÁé','Ê«Áø','ÏÄÁø','²É°×','Ä½Ã·','ÀÖ°²','¶¬Áâ','×Ï°²','ÍğÄı','ÓêÑ©','Ò×Õæ','°²ºÉ','¾²Öñ','´úÈá','µ¤Çï','ç²Ã·','ÒÀ°×','ÄıºÉ','Ó×Éº','ÒäÍ®','ÁèÇà','Ö®ÌÒ','ÜÆºÉ','ÌıºÉ','´úÓñ','ÄîÕä','ÃÎ·Æ','Ò¹´º','Ç§Çï','°×Çï','¹ÈÁâ','·ÉËÉ','³õÑş','Ï§Áé','ºŞÑş','ÃÎÒ×','ĞÂÑş','ÂüÃ·','±ÌÂü','ÓÑÑş','ÓêÀ¼','Ò¹Áø','Ïãµû','ÅÎÇÉ','ÜÆÕä','Ïã»Ü','º¬Ü½','Ò¹ÔÆ','ÒÀİæ','ÄıÑã','ÒÔÁ«','Ò×Èİ','ÔªÁø','°²ÄÏ','Ó×Çç','¶ûÇÙ','·ÉÑô','°×·²','ÅæÆ¼','Ñ©Ñş','Ïò»Ü','²ÉÎÄ','ÀÖÕä','º®ºÉ','ÃÙË«','°×ÌÒ','°²»Ü','Ó­Âü','ÅÎÑã','ÀÖËÉ','º­É½','ºŞº®','ÎÊ·ã','ÒÔÁø','º¬º£','Çï´º','´äÂü','ÒäÃ·','º­Áø','ÃÎÏã','º£À¶','ÏşÂü','´úÉº','´º¶¬','ºŞºÉ','Òäµ¤','¾²Ü½','ç²À¼','ÃÎ°²','×ÏË¿','Ç§Ñã','ÄıÕä','Ïãİæ','ÃÎÈİ','ÀäÑã','·É°Ø','ÌìÕæ','´äÇÙ','¼ÄÕæ','ÇïºÉ','¾şÎõ','¼ÎÜ²','ìÏ³Ç','Ü²Ğù','ìÇ»ª','ìÏì÷','ÖÇå·','ÕıºÀ','ê»È»','Ö¾Ôó','Ã÷½Ü','ºëÎÄ','ìÇÎ°','Ô·²©','ÅôÌÎ','Ñ×±ò','º×Ğù','Î°Ôó','¾ıê»','ìÚÍ®','ºèìÓ','²©ÌÎ','Ô·½Ü','Àèê¿','ìÇÁØ','ÕÜå«','ÓêÔó','¿¬Èğ','½¨»Ô','ÖÂÔ¶','¿¡³Û','ÓêÔó','ìÇÀÚ','¹úºÀ','Î°Ææ','ÎÄ²©','ÌìÓÓ','ÎÄê»','ĞŞ½Ü','Àèê¿','Ô¶º½','ĞñÒ¢','Ó¢½Ü','Ê¥½Ü','öÎÅô','¿¡éª','ºèÌÎ','Î°ì÷','ÈÙĞù','ºÆÓî','½úÅô','èªè¤','ê»Ìì','ÏşĞ¥','Á¢¹û');
   
   familyarr arrtype:=arrtype('ÕÔ','Ç®','Ëï','Àî','ÖÜ','Îâ','Ö£','Íõ','·ë','³Â','ñÒ','ÎÀ','½¯','Éò','º«','Ñî','Öì','ÇØ','ÓÈ','Ğí','ºÎ','ÂÀ','Ê©','ÕÅ','¿×','²Ü','ÑÏ','»ª','½ğ','Îº','ÌÕ','½ª','Æİ','Ğ»','×Ş','Ó÷','°Ø','Ë®','ñ¼','ÕÂ','ÔÆ','ËÕ','ÅË','¸ğ','·¶','Åí','ÀÉ','Â³','Î¤','²ı','Âí','Ãç','·½','Óá','ÈÎ','Ô¬','Áø','±«','Ê·','ÌÆ','·Ñ','Ñ¦','À×','ºØ','Òó','ÂŞ','±Ï','ºÂ','¸µ','±å','Æë','¿µ','Îé','Óà','¹Ë','ÃÏ','»Æ','ÄÂ','Ïô','Òü','Ò¦','ÉÛ','Íô','Æî','Ã«','µÒ','ê°','·ü','´÷','ËÎ','ÅÓ','ĞÜ','¼Í','Çü','Ïî','×£','¶­','Áº','¶Å','Èî','À¶','ãÉ','¼Ö','Í¯','ÑÕ','¹ù','ÁÖ','ÖÓ','Ğì','Çñ','Âæ','¸ß','ÏÄ','²Ì','Ìï','ºú','Áè','»ô','Íò','¿Â','Â¬','¿Â','·¿','ôÃ','çÑ','×Ú','¶¡','µË','µ¥','ºé','°ü','Öî','´Ş','¹¨','³Ì','ĞÏ','Åá','Â½','ÎÌ','Õç','Çú','¶Î','Î×','ÎÚ','½¹','¹È','³µ','ºî','È«','Û­','°à','ÖÙ','ÒÁ','¹¬','³ğ','Îä','·û','Áõ','¾°','Õ²','Êø','Áú','Ò¶','ĞÒ','Ë¾','Û¬','Àè','°×','Û¢','´Ó','¶õ','Ë÷','ÏÌ','¼®','Àµ','×¿','İş','ÍÀ','ÃÉ','³Ø','ÇÇ','Ñô','Óô','ñã','ÄÜ','²Ô','Ë«','ÎÅ','İ·','µ³','µÔ','Ì·','¼§','Éê','·ö','¶Â','È½','Ô×','Ûª','Óº','É£','¹ğ','å§','Å£','ÊÙ','Í¨','±ß','ìè','¼½','ÆÖ','ÉĞ','Å©','ÎÂ','±ğ','×¯','êÌ','²ñ','öÄ','ÑÖ','³ä','Ä½','Á¬','Èã','Ï°','»Â','°¬','Óã','Èİ','Ïò','¹Å','Ò×','É÷','¸ê','ÁÎ','â×','ÖÕ','ôß','¾Ó','ºâ','²½','¶¼','¹¢','Âú','ºë','¿ï','¹ú','ÎÄ','¿Ü','¹ã','Â»','ãÚ','¶«','Å·','ì¯','ÎÖ','Àû','Îµ','Ô½','Ùç','Â¡','Ê¦','¹®','ØÇ','Äô','êË','¹´','°½','ÈÚ','Àä','ö¤','ĞÁ','ãÛ','ÄÇ','¼ò','ÈÄ','¿Õ','Ôø','Îã','É³','Ø¿','Ñø','¾Ï','Ğë','·á','³²','¹Ø','Øá','Ïà','²é','ºó','¾£','ÓÎ','¹«','Ë¾Âí','ÉÏ¹Ù','Å·Ñô','Öî¸ğ','»Ê¸¦','Î¾³Ù','µ¥ÓÚ','Ì«Êå','¹«Ëï','ĞùÔ¯','Áîºü','ÓîÎÄ','³¤Ëï','Ä½Èİ','Ë¾Í½');
    
   namelen number;
   familylen number;
   
   namerand number;
   familyrand number;
   
   namestr varchar2(100):='';
   
   vsql varchar2(2000);
   
   varea vip_area%rowtype;
   vcity vip_city%rowtype; 
   vpro vip_province%rowtype; 
   
   areaid number; --µØÇøid
   cityid number; --³ÇÊĞid
   ncountry number;--Ê¡·İcode
    
   areacount number;
   
   arearand number;
   
   vareacity varchar2(50);
   vcountry varchar2(50);--Ê¡·İ
   
  
   
begin  
     
     for i in 1..10000 loop
   
       --Ãû×ÖËæ»ú
       namelen := namearr.count;
        
       familylen := familyarr.count;
      
       namerand := floor(dbms_random.value * namelen);
       
       familyrand:=floor(dbms_random.value * familylen);
       
       --dbms_output.put_line(namelen||'  '||familylen ||' '||namerand||' '||familyrand); --ĞÕÃû
       
       if namerand=0 then 
          namerand := 1;
       end if;
       
       if familyrand=0 then 
          familyrand := 1;
       end if;
       
       namestr :=familyarr(familyrand) || ''|| namearr(namerand);--ĞÕÃû Ô½½ç
       
       select count(*) into areacount from vip_area;
       
       areaid:=floor(dbms_random.value * areacount);
       
       if areaid=0 then       
          areaid:=1;       
       end if;
            
       select * into varea from vip_area where n_id = areaid;
       
       vareacity:=varea.v_city;--Ê¡·İ000  ³ÇÊĞ11
       
       vcountry:=substr(vareacity,1,3);--Ê¡·İ
       
       select * into vcity from vip_city where v_code=substr(vareacity,4,5) and v_province=vcountry;
       
       cityid:=vcity.n_id;--³ÇÊĞid
       
       ncountry:=to_number(vcountry);--Ê¡·İcode
	   
	   select * into vpro from vip_province where v_code = vcountry;
       
       vsql:='insert into t_client(phone,name,type,code,provice,city,room,regdate,address,area,brand,isparty,isgroup,bigdate,grade) values(:phone,:name,:type,:code,:provice,:city,:room,:regdate,:address,:area,:brand,:isparty,:isgroup,:bigdate,:grade)';
       
       if i<9000 then
       
         EXECUTE immediate vsql using '132888'||lpad(i,5,0),namestr,'Éí·İÖ¤','3505241987110'||lpad(i,5,0),ncountry,cityid,'µÚ'||mod(i,10)||'ÓªÒµÌü',sysdate,vpro.v_name||''||vcity.v_name||''||varea.v_name,areaid,to_number(lpad(to_char(mod(i,4)),2,'1')),0,0,sysdate,to_number(lpad(to_char(mod(i,4)),2,'2'));
               
         commit;
      else 
         EXECUTE immediate vsql using '132888'||lpad(i,5,0),namestr,'¾ü¹ÙÖ¤','65895561'||lpad(i,5,0),ncountry,cityid,'µÚ'||mod(i,10)||'ÓªÒµÌü',sysdate,vpro.v_name||''||vcity.v_name||''||varea.v_name,areaid,to_number(lpad(to_char(mod(i,4)),2,'1')),1,0,sysdate,to_number(lpad(to_char(mod(i,4)),2,'2'));
               
         commit;  
        
      end if;
    end loop; 
     
end;

/
